HAMES2-1st-3/TunnelComfortSystemTesting/include/tc37xa/IfxCpu_reg.h
/** \brief FF04, CPUx Data General Purpose Register 1 */
#define CPU2_D1 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_D*)0xF885FF04u)

/** \brief FF08, CPUx Data General Purpose Register 2 */
#define CPU2_D2 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_D*)0xF885FF08u)

/** \brief FF0C, CPUx Data General Purpose Register 3 */
#define CPU2_D3 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_D*)0xF885FF0Cu)

/** \brief FF10, CPUx Data General Purpose Register 4 */
#define CPU2_D4 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_D*)0xF885FF10u)

/** \brief FF14, CPUx Data General Purpose Register 5 */
#define CPU2_D5 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_D*)0xF885FF14u)

/** \brief FF18, CPUx Data General Purpose Register 6 */
#define CPU2_D6 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_D*)0xF885FF18u)

/** \brief FF1C, CPUx Data General Purpose Register 7 */
#define CPU2_D7 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_D*)0xF885FF1Cu)

/** \brief FF20, CPUx Data General Purpose Register 8 */
#define CPU2_D8 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_D*)0xF885FF20u)

/** \brief FF24, CPUx Data General Purpose Register 9 */
#define CPU2_D9 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_D*)0xF885FF24u)

/** \brief FF28, CPUx Data General Purpose Register 10 */
#define CPU2_D10 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_D*)0xF885FF28u)

/** \brief FF2C, CPUx Data General Purpose Register 11 */
#define CPU2_D11 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_D*)0xF885FF2Cu)

/** \brief FF30, CPUx Data General Purpose Register 12 */
#define CPU2_D12 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_D*)0xF885FF30u)

/** \brief FF34, CPUx Data General Purpose Register 13 */
#define CPU2_D13 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_D*)0xF885FF34u)

/** \brief FF38, CPUx Data General Purpose Register 14 */
#define CPU2_D14 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_D*)0xF885FF38u)

/** \brief FF3C, CPUx Data General Purpose Register 15 */
#define CPU2_D15 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_D*)0xF885FF3Cu)

/** \brief FF80, CPUx Address General Purpose Register 0 */
#define CPU2_A0 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_A*)0xF885FF80u)

/** \brief FF84, CPUx Address General Purpose Register 1 */
#define CPU2_A1 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_A*)0xF885FF84u)

/** \brief FF88, CPUx Address General Purpose Register 2 */
#define CPU2_A2 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_A*)0xF885FF88u)

/** \brief FF8C, CPUx Address General Purpose Register 3 */
#define CPU2_A3 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_A*)0xF885FF8Cu)

/** \brief FF90, CPUx Address General Purpose Register 4 */
#define CPU2_A4 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_A*)0xF885FF90u)

/** \brief FF94, CPUx Address General Purpose Register 5 */
#define CPU2_A5 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_A*)0xF885FF94u)

/** \brief FF98, CPUx Address General Purpose Register 6 */
#define CPU2_A6 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_A*)0xF885FF98u)

/** \brief FF9C, CPUx Address General Purpose Register 7 */
#define CPU2_A7 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_A*)0xF885FF9Cu)

/** \brief FFA0, CPUx Address General Purpose Register 8 */
#define CPU2_A8 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_A*)0xF885FFA0u)

/** \brief FFA4, CPUx Address General Purpose Register 9 */
#define CPU2_A9 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_A*)0xF885FFA4u)

/** \brief FFA8, CPUx Address General Purpose Register 10 */
#define CPU2_A10 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_A*)0xF885FFA8u)

/** \brief FFAC, CPUx Address General Purpose Register 11 */
#define CPU2_A11 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_A*)0xF885FFACu)

/** \brief FFB0, CPUx Address General Purpose Register 12 */
#define CPU2_A12 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_A*)0xF885FFB0u)

/** \brief FFB4, CPUx Address General Purpose Register 13 */
#define CPU2_A13 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_A*)0xF885FFB4u)

/** \brief FFB8, CPUx Address General Purpose Register 14 */
#define CPU2_A14 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_A*)0xF885FFB8u)

/** \brief FFBC, CPUx Address General Purpose Register 15 */
#define CPU2_A15 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_A*)0xF885FFBCu)


/** \}  */

/******************************************************************************/

/******************************************************************************/

#endif /* IFXCPU_REG_H */
